Revit 2027 API
NumberedReferenceInfo.PartitionName Property
 The partition associated with this reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string PartitionName { get; }
Public ReadOnly Property PartitionName As String
	Get
public:
property String^ PartitionName {
	String^ get ();
}
member PartitionName : string with get
Property Value
String
See Also
Reference
NumberedReferenceInfo Class
Autodesk.Revit.DB Namespace